Repository: alessio-zamparelli/ipolito
Catalog: iPoliTO2/*.lproj/Localizable.strings
Languages: it

# ls.generic.alert.dismiss
source: Dismiss
it: Ok

# ls.generic.alert.continue
source: Continue
it: Continua

# ls.generic.alert.confirm
source: Confirm
it: Conferma

# ls.generic.alert.retry
source: Retry
it: Riprova

# ls.generic.alert.cancel
source: Cancel
it: Annulla

# ls.generic.alert.edit
source: Edit
it: Modifica

# ls.generic.ptRequestError.notConnectedToInternet
source: You're not connected to the internet!
it: Non sei connesso ad internet.

# ls.generic.ptRequestError.serverUnreachable
source: Servers unreachable or under maintenance!
it: Server non disponibile o in manutenzione.

# ls.generic.ptRequestError.timedOut
source: Request took too long! Try again.
it: Connessione lenta! Prova di nuovo.

# ls.generic.ptRequestError.unknown
source: An unknown error has occurred!
it: Errore sconosciuto.

# ls.generic.ptRequestError.invalidCredentials
source: Invalid credentials!
it: Account inesistente o password errata.

# ls.generic.status.loggingIn
source: Logging in...
it: Effettuo login...

# ls.generic.status.loading
source: Loading...
it: Caricamento...

# ls.generic.status.couldNotRetrieve
source: Unable to retrieve the data!
it: Impossibile scaricare i dati!

# ls.generic.credits
source: ECTS
it: CFU

# ls.appDelegate.justUpdatedAlert.title
source: What's new in v2.2.1
it: Novità della versione 2.1

# ls.appDelegate.justDownloadedAlert.title
source: Welcome
it: Benvenuto

# ls.appDelegate.justDownloadedAlert.body
source: Thank you for downloading iPoliTO!
it: Grazie per aver scaricato iPoliTO!

# ls.appDelegate.partiallyMissingInfoAlert.body
source: There was a problem while downloading the data. Some information might be missing.
it: C'è stato un problema durante il download dei dati. Alcune informazioni potrebbero risultare mancanti.

# ls.appDelegate.couldNotLogoutAlert.body
source: Could not logout at this time!
it: Non è stato possibile effettuare il logout in questo momento.

# ls.homeVC.status.loading
source: Loading schedule...
it: Carico orario...

# ls.homeVC.status.updating
source: Updating schedule...
it: Aggiorno orario...

# ls.homeVC.status.noLectures
source: No lectures this week!
it: Nessuna lezione questa settimana!

# ls.homeVC.noMapAlert.body
source: Map not available for this room!
it: Mappa non disponibile per quest'aula.

# ls.subjectsVC.status.loading
source: Loading data of subjects...
it: Carico avvisi e materiale...

# ls.subjectsVC.status.noSubjects
source: No subjects on your course load!
it: Nessuna materia trovata!

# ls.subjectsVC.subjectOptions.messages
source: Messages
it: Messaggi

# ls.subjectsVC.subjectOptions.messages.unread
source: unread
it: non letti

# ls.subjectsVC.subjectOptions.documents
source: Documents
it: Materiale

# ls.subjectsVC.subjectOptions.info
source: About this subject
it: Informazioni e guida

# ls.subjectsVC.noFilesOrMessagesAlert.body
source: This course doesn't have any messages or files.
it: Questo corso non ha alcun messaggio né file.

# ls.subjectsVC.invalidSubjectDataAlert.body
source: Something went wrong when trying to retrieve data for this subject.
it: Non è stato possibile scaricare i dati per questa materia.

# ls.careerVC.status.loading
source: Loading temporary grades...
it: Carico valutazioni prov...

# ls.careerVC.status.emptyCareer
source: No exams on your career!
it: Nessun esame passato!

# ls.careerVC.section.tempGrades
source: Temporary Grades
it: Valutazioni provvisorie

# ls.careerVC.section.grades
source: Grades
it: Voti

# ls.careerVC.section.details
source: Details
it: Dettagli

# ls.careerVC.section.overview
source: Overview
it: Panoramica

# ls.careerVC.tempGrade.absent
source: Absent
it: Assente

# ls.careerVC.tempGrade.failed
source: Failed
it: Respinto

# ls.careerVC.tempGrade.state
source: State
it: Stato

# ls.careerVC.chart.noData
source: Not enough data
it: Non ci sono abbastanza dati

# ls.mapVC.searchBarPlaceholder
source: Search for a room
it: Cerca un'aula

# ls.mapVC.title
source: Map
it: Mappa

# ls.mapVC.showingFreeRoomsFor
source: Showing free rooms for
it: In verde aule libere alle

# ls.mapVC.status.loading
source: Loading free rooms...
it: Carico aule libere...

# ls.mapVC.freeRoom.status.free
source: Free
it: Libera

# ls.mapVC.freeRoom.status.occupied
source: Occupied
it: Occupata

# ls.mapVC.freeRoomsError
source: Unable to load free rooms
it: Impossibile scaricare aule libere

# ls.settingsVC.logoutAlert.title
source: Warning
it: Attenzione

# ls.settingsVC.logoutAlert.body
source: Are you sure you want to logout?
it: Sei sicuro di voler effettuare il logout?

# ls.settingsVC.tellSomeFriendsBody
source: Check out iPoliTO: the first iOS app for the students at Politecnico di Torino!
it: Scarica iPoliTO: la prima app per iOS dedicata agli studenti del Politecnico di Torino!

# ls.settingsVC.noEmailConfiguredAlert.body
source: No email accounts configured!
it: Non è stato configurato alcun account email su questo dispositivo!

# ls.documentsVC.downloadAlert.title
source: Do you want to download this file?
it: Vuoi scaricare questo file?

# ls.documentsVC.downloadAlert.body1
source: You chose
it: Hai scelto

# ls.documentsVC.alreadyDownloadedAlert.title
source: File already downloaded!
it: File già scaricato!

# ls.downloadsVC.section.transfers
source: Transfers
it: Trasferimenti

# ls.downloadsVC.section.completed
source: Completed
it: Completati

# ls.downloadsVC.action.retry
source: Retry
it: Riprova

# ls.downloadsVC.action.resume
source: Resume
it: Riavvia

# ls.downloadsVC.action.pause
source: Pause
it: Pausa

# ls.downloadsVC.action.cancel
source: Cancel
it: Annulla

# ls.downloadsVC.action.delete
source: Delete
it: Cancella

# ls.downloadsVC.fileDoesntExistAlert.body
source: This file appears to be damaged! Try to download it again.
it: Questo file potrebbe essere danneggiato! Prova a scaricarlo nuovamente.

# ls.downloadsVC.progressPreposition
source: of
it: di

# ls.downloadsVC.downloadedOn
source: Downloaded on
it: Scaricato il

# ls.downloadsVC.noDownloads
source: Nothing to see here!
it: Nessun download!

# ls.timePicker.subtitle
source: Look up free rooms at
it: Visualizza aule libere alle

# ls.ptTerm.first
source: 1st term
it: 1º sem.

# ls.ptTerm.second
source: 2nd term
it: 2º sem.

# ls.ptTerm.both
source: 1st or 2nd term
it: 1º o 2º sem.

# ls.fileTransfer.status.downloading
source: Downloading...
it: Scarico...

# ls.fileTransfer.status.cancelled
source: Cancelled
it: Annullato

# ls.fileTransfer.status.failed
source: Failed
it: Fallito

# ls.fileTransfer.status.paused
source: Paused
it: In pausa

# ls.fileTransfer.status.completed
source: Completed
it: Completato

# ls.fileTransfer.status.waitingForURL
source: Waiting for a valid URL
it: In attesa di una URL valida

# ls.fileTransfer.status.onQueue
source: On queue
it: In coda
